src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДействияПриПолученииДанныхОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Загружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КакЗагружать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийПриПолученииДанныхОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстанавливатьСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтратегияПоискаПоКлючам</Name>
					<Comment>Может принимать значения "Оптимально" или "Стандарт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияУстановленыАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтратегииПоиска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена/Forms/ИзменениеЗаписи/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗагружатьПриИзменении(Элемент)
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ДанныеВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	Загружать                           = ?(Параметры.Загружать, "Загружать", "НеЗагружать");
	ПредставлениеТипаМетаданных         = Параметры.ПредставлениеТипаМетаданных;
	
	Элементы.ОбъектМетаданных.Заголовок = РаботаСРезультатамиОбменаКлиентСервер.ТекстДляПоИмениОбъектаМетаданных(Параметры.ИмяТипаМетаданных);
	Элементы.ГруппаЗагружать.Заголовок  = ЗаголовокЗагружатьПо(Параметры.ИмяТипаМетаданных);
	
	УстанавливатьСоответствия           = Параметры.УстанавливатьСоответствия;
	КакЗагружать                        = Параметры.КакЗагружать;
	Комментарий                         = Параметры.Комментарий;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.УстанавливатьСоответствия.ТолькоПросмотр = Форма.Загружать = "НеЗагружать";
	ЭлементыФормы.КакЗагружать.ТолькоПросмотр              = Форма.Загружать = "НеЗагружать";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокЗагружатьПо(ИмяТипаМетаданных)
	
	Возврат СтрШаблон(НСтр("ru = '%1 данного типа:'"), ЗаголовокРаздельно(ИмяТипаМетаданных));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокРаздельно(ИсточникСтрока)
	
	Если ИсточникСтрока = "Справочники" Тогда
		
		Возврат НСтр("ru = 'Элементы справочника'");
		
	ИначеЕсли ИсточникСтрока = "Документы" Тогда
		
		Возврат НСтр("ru = 'Документы'");
		
	ИначеЕсли ИсточникСтрока = "РегистрыСведений" Тогда
		
		Возврат НСтр("ru = 'Записи регистра сведений'");
		
	ИначеЕсли ИсточникСтрока = "РегистрыНакоплений" Тогда
		
		Возврат НСтр("ru = 'Записи регистра накопления'");
		
	ИначеЕсли ИсточникСтрока = "РегистрыРасчета" Тогда
		
		Возврат НСтр("ru = 'Записи регистра расчетов'");
		
	ИначеЕсли ИсточникСтрока = "ПланыВидовХарактеристик" Тогда
		
		Возврат НСтр("ru = 'Элементы плана видов характеристик'");
		
	Иначе
		
		Возврат ИсточникСтрока;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ДанныеВозврата()

	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("Загружать",                  Загружать = "Загружать");
	ДанныеВозврата.Вставить("УстанавливатьСоответствия",  УстанавливатьСоответствия);
	ДанныеВозврата.Вставить("КакЗагружать",               КакЗагружать);
	ДанныеВозврата.Вставить("Комментарий",                Комментарий);
	ДанныеВозврата.Вставить("НаличиеКомментария",         НЕ ПустаяСтрока(Комментарий));
	Возврат ДанныеВозврата;

КонецФункции

#КонецОбласти
